In [1]:
import pandas as pd

In [6]:
from pathlib import Path

EXCELS_DIR = r"C:\Users\andre\IdeaProjects\TyuiuDirectionsRecSys\data\10 лет"

files = {}
for file_path in Path(EXCELS_DIR).iterdir():
    year = str(file_path).split(".")[0][-4:]
    files[year] = file_path
files

{'2014': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2014.xls'),
 '2015': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2015.xls'),
 '2016': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2016.xls'),
 '2017': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2017.xls'),
 '2018': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2018.xls'),
 '2019': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2019.xlsx'),
 '2020': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2020.xlsx'),
 '2021': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2021.xlsx'),
 '2022': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2022.xlsx'),
 '2023': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2023.xlsx'),
 '2024': WindowsPath('C:/Users/andre/IdeaProjects/TyuiuDirectionsRecSys/data/10 лет/2024.xlsx')}

In [7]:
df_2014 = pd.read_excel(files["2014"])

In [10]:
df_2014 = df_2014[["Зачислен на направление подготовки (специальность)", "Зачислен по виду возмещения затрат", "Сумма баллов"]]
df_2014.head(3)

,Зачислен на направление подготовки (специальность),Зачислен по виду возмещения затрат,Сумма баллов
0,21.03.01 Нефтегазовое дело (Академический бака...,бюджет,184
1,21.03.01 Нефтегазовое дело (Академический бака...,по договору,123
2,"38.03.02 Менеджмент (Академический бакалавр, К...",бюджет,185

In [11]:
df_2014 = df_2014[df_2014["Зачислен по виду возмещения затрат"] == "бюджет"]
df_2014.head(3)

,Зачислен на направление подготовки (специальность),Зачислен по виду возмещения затрат,Сумма баллов
0,21.03.01 Нефтегазовое дело (Академический бака...,бюджет,184
2,"38.03.02 Менеджмент (Академический бакалавр, К...",бюджет,185
4,21.05.02 Прикладная геология (Горный инженер-г...,бюджет,170

In [12]:
df_2014 = df_2014.groupby('Зачислен на направление подготовки (специальность)')['Сумма баллов'].min().reset_index()
df_2014.head(5)

  Зачислен на направление подготовки (специальность)  Сумма баллов
0  05.03.01 Геология (Академический бакалавр, Каф...           133
1  09.03.01 Информатика и вычислительная техника ...           136
2  09.03.02 Информационные системы и технологии (...           146
3  12.03.01 Приборостроение (Академический бакала...           146
4  12.03.04 Биотехнические системы и технологии (...           113

In [14]:
df_2014["Год"] = 2014

In [15]:
df_2014.to_csv("ТИУ_проходные_баллы_2014.csv")

In [28]:
df_2015 = pd.read_excel(files["2015"])
df_2015 = df_2015[["Вид возмещения затрат", "Направление, специальность, профессия", "Итоговая сумма баллов"]]
df_2015.head(3)

,Вид возмещения затрат,"Направление, специальность, профессия",Итоговая сумма баллов
0,по договору,21.03.01 Нефтегазовое дело,"49,00"
1,по договору,13.03.02 Электроэнергетика и электротехника,"80,00"
2,по договору,21.03.01 Нефтегазовое дело,"52,00"

In [29]:
df_2015 = df_2015[df_2015["Вид возмещения затрат"] == "бюджет"]
df_2015.head(3)

,Вид возмещения затрат,"Направление, специальность, профессия",Итоговая сумма баллов
5,бюджет,12.03.01 Приборостроение,"178,00"
18,бюджет,21.05.02 Прикладная геология,"214,00"
20,бюджет,13.03.02 Электроэнергетика и электротехника,"91,00"

In [ ]:
df_2015["Итоговая сумма баллов"] = pd.to_numeric(df_2015['Итоговая сумма баллов'].str.replace(',', '.', regex=False), errors='coerce')

In [32]:
df_2015 = df_2015.groupby('Направление, специальность, профессия')['Итоговая сумма баллов'].min().reset_index()
df_2015["Год"] = 2015
df_2015.head(3)

           Направление, специальность, профессия  Итоговая сумма баллов   Год
0                              05.03.01 Геология                  125.0  2015
1  09.03.01 Информатика и вычислительная техника                  146.0  2015
2   09.03.02 Информационные системы и технологии                  150.0  2015

In [33]:
df_2015.to_csv("ТИУ_проходные_баллы_2015.csv")

In [34]:
df_2016 = pd.read_excel(files["2016"])
df_2016 = df_2016[["Вид возмещения затрат", "Направление, специальность, профессия", "Итоговая сумма баллов"]]
df_2016 = df_2016[df_2016["Вид возмещения затрат"] == "бюджет"]
df_2016.head(3)

,Вид возмещения затрат,"Направление, специальность, профессия",Итоговая сумма баллов
1,бюджет,21.03.01 Нефтегазовое дело,"168,00"
2,бюджет,27.03.04 Управление в технических системах,"170,00"
4,бюджет,12.03.04 Биотехнические системы и технологии,"232,00"

In [35]:
df_2016["Итоговая сумма баллов"] = pd.to_numeric(df_2016['Итоговая сумма баллов'].str.replace(',', '.', regex=False), errors='coerce')
df_2016 = df_2016.groupby('Направление, специальность, профессия')['Итоговая сумма баллов'].min().reset_index()
df_2016["Год"] = 2016
df_2016.head(3)

  Направление, специальность, профессия  Итоговая сумма баллов   Год
0                     05.03.01 Геология                  156.0  2016
1                  07.03.01 Архитектура                  267.0  2016
2   07.03.03 Дизайн архитектурной среды                  239.0  2016

In [36]:
df_2016.to_csv("ТИУ_проходные_баллы_2016.csv")

In [37]:
df_2017 = pd.read_excel(files["2017"])
df_2017 = df_2017[["Вид возмещения затрат", "Направление, специальность, профессия", "Итоговая сумма баллов"]]
df_2017 = df_2017[df_2017["Вид возмещения затрат"] == "бюджет"]
df_2017.head(3)

,Вид возмещения затрат,"Направление, специальность, профессия",Итоговая сумма баллов
0,бюджет,21.05.02 Прикладная геология,"217,00"
1,бюджет,21.03.01 Нефтегазовое дело,"175,00"
3,бюджет,21.03.01 Нефтегазовое дело,"231,00"

In [38]:
df_2017["Итоговая сумма баллов"] = pd.to_numeric(df_2017['Итоговая сумма баллов'].str.replace(',', '.', regex=False), errors='coerce')
df_2017 = df_2017.groupby('Направление, специальность, профессия')['Итоговая сумма баллов'].min().reset_index()
df_2017["Год"] = 2017
df_2017.head(3)

  Направление, специальность, профессия  Итоговая сумма баллов   Год
0                     05.03.01 Геология                  185.0  2017
1                  07.03.01 Архитектура                  304.0  2017
2   07.03.03 Дизайн архитектурной среды                  292.0  2017

In [39]:
df_2017.to_csv("ТИУ_проходные_баллы_2017.csv")

In [40]:
df_2018 = pd.read_excel(files["2018"])
df_2018 = df_2018[["Вид возмещения затрат", "Направление, специальность, профессия", "Итоговая сумма баллов"]]
df_2018 = df_2018[df_2018["Вид возмещения затрат"] == "бюджет"]
df_2018.head(3)

,Вид возмещения затрат,"Направление, специальность, профессия",Итоговая сумма баллов
0,бюджет,21.05.02 Прикладная геология,"217,00"
1,бюджет,21.03.01 Нефтегазовое дело,"175,00"
3,бюджет,21.03.01 Нефтегазовое дело,"231,00"

In [41]:
df_2018["Итоговая сумма баллов"] = pd.to_numeric(df_2018['Итоговая сумма баллов'].str.replace(',', '.', regex=False), errors='coerce')
df_2018 = df_2018.groupby('Направление, специальность, профессия')['Итоговая сумма баллов'].min().reset_index()
df_2018["Год"] = 2018
df_2018.head(3)

  Направление, специальность, профессия  Итоговая сумма баллов   Год
0                     05.03.01 Геология                  185.0  2018
1                  07.03.01 Архитектура                  304.0  2018
2   07.03.03 Дизайн архитектурной среды                  292.0  2018

In [42]:
df_2018.to_csv("ТИУ_проходные_баллы_2018.csv")